docs: Updating documentation to latest version
